#include<iostream>
using namespace std;

int main() {
	float a1 = (3.5 * 3 + 2 * 7 - 'a');
	cout << a1 << '\n';

	float a2 = (26 / 3 + 34 % 3 + 2.5);     // 26/3 是按照整型的计算算出来结果位 8 ，因为根据优先级先除再加后面的浮点型，在此时才会转位浮点型
	cout << a2<<'\n';

	float a3 = 45 / 2 + (int)3.14159 / 2;   // (int)优先级高先将 3.14159转换为3
	cout  << a3<< '\n';

	int a=3, b, c;
	a = b = (c = a += 6);
	cout << "a = " << a << '\n' << "b = " << b << '\n' << "c = "<< c << '\n';      //c++中输出字符串必须要用双引号 ，单引号输出的是字符

	a = 3 * 5,a = b = 3 * 2;                                       //使用了逗号运算符，结果为最后一个逗号后计算的结果 ：先计算 a=3*5=15 ，再计算a=b=3*2=6  ,结果为6
	cout << "a=" << a << '\n';

	float a6 = (int)(a + 6.5) % 2 + (a = b = 5);           //从右向左运算，a=b=5  ;先计算a+6.5=11.5, (int)11.5=11  ,11%2=1  ; 1+5=6
	cout << "a6=" << a6 << '\n';

	a = 7;
	float x = 2.5, y = 4.7;
	float a7 = x + a % 3 * (int)(x + y) % 2 / 4;      // 先取余再相乘 ，最后再相加， a%3=2.5  ,(int)(x+y)%2/4=(int)(7.1)%0.5=7%0.5=0 ,  2.5*0=0  ; 0+2.5=2.75
	cout << "a7=" << a7 << '\n';

	a = 2, b = 3, x = 3.5, y = 2.5;
	float a8 = (float)(a + b) / 2 + (int)x % (int)y;      //前面的虽然是5，但是是浮点数，5/2的结果不是整型的2而是浮点的2.5  ；后面的 3%2=1 结果为 2.5+1=3.5
	cout << "a8=" << a8 << '\n';
	return 0;
}